xml/cc/single_user_full_dump_staging_all_scenarios.xml
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE tsung SYSTEM "/Users/stephen/src/tsung-wrapper/config/project/cc/tsung-1.0.dtd">
<tsung loglevel="debug" dumptraffic="true" version="1.0">
  <!-- Client Side Setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="9000"/>
  </clients>
  <!-- Server Side Setup -->
  <servers>
    <server host="test_server_host" port="443" type="tcp"/>
  </servers>
  <load>
    <!-- Scenario 1: Single User -->
    <arrivalphase phase="1" duration="6" unit="second">
      <users maxnumber="1" arrivalrate="5" unit="second"/>
    </arrivalphase>
  </load>
  <options>
    <!-- Define User Agents -->
    <option type="ts_http" name="user_agent">
      <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
      <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>
  <sessions>
    <session name="scenario_01_session-20140604-170746" probability="100" type="ts_http">
      <!-- GET Landing Page -->
      <thinktime random="true" value="4"/>
      <request>
        <match do="abort" when="match" name="abort_unless_success_or_redirect">HTTP/1.1 [^2|^3][0-9]{2}</match>
        <http url="https://civilclaimsstaging.dsd.io:443/accelerated-possession-eviction" version="1.1" method="GET">
          <www_authenticate userid="civil" passwd="mojcivil"/>
        </http>
      </request>
      <!--  -->
      <thinktime random="true" value="4"/>
      <request>
        <match do="abort" when="match" name="abort_unless_success_or_redirect">HTTP/1.1 [^2|^3][0-9]{2}</match>
        <http url="https://civilclaimsstaging.dsd.io:443/accelerated-possession-eviction/submission" version="1.1" contents="claim%5Bclaimant_contact%5D%5Bcompany_name%5D=Linley+%26+Simpson&amp;claim%5Bclaimant_contact%5D%5Bdx_number%5D=&amp;claim%5Bclaimant_contact%5D%5Bemail%5D=robertlinley%40linleyandsimpson.com&amp;claim%5Bclaimant_contact%5D%5Bfax%5D=&amp;claim%5Bclaimant_contact%5D%5Bfull_name%5D=Robert+Linley&amp;claim%5Bclaimant_contact%5D%5Bphone%5D=0113+246+9295&amp;claim%5Bclaimant_contact%5D%5Bpostcode%5D=LS1+4AG&amp;claim%5Bclaimant_contact%5D%5Bstreet%5D=16+Swinegate%0ALeeds&amp;claim%5Bclaimant_contact%5D%5Btitle%5D=Mr+&amp;claim%5Bclaimant_one%5D%5Bfull_name%5D=Matthew+Collier&amp;claim%5Bclaimant_one%5D%5Bpostcode%5D=LS5+3RP&amp;claim%5Bclaimant_one%5D%5Bstreet%5D=2+Savins+Mill+Way%0ALeeds&amp;claim%5Bclaimant_one%5D%5Btitle%5D=Mr+&amp;claim%5Bclaimant_two%5D%5Bfull_name%5D=Violet+Collier&amp;claim%5Bclaimant_two%5D%5Bpostcode%5D=&amp;claim%5Bclaimant_two%5D%5Bstreet%5D=&amp;claim%5Bclaimant_two%5D%5Btitle%5D=Mrs&amp;claim%5Bdefendant_one%5D%5Bfull_name%5D=Virginia+Richardson&amp;claim%5Bdefendant_one%5D%5Bpostcode%5D=&amp;claim%5Bdefendant_one%5D%5Bstreet%5D=&amp;claim%5Bdefendant_one%5D%5Btitle%5D=Miss&amp;claim%5Bdefendant_two%5D%5Bfull_name%5D=Maria+Gonzalez&amp;claim%5Bdefendant_two%5D%5Bpostcode%5D=&amp;claim%5Bdefendant_two%5D%5Bstreet%5D=&amp;claim%5Bdefendant_two%5D%5Btitle%5D=Miss&amp;claim%5Bdeposit%5D%5Bas_money%5D=Yes&amp;claim%5Bdeposit%5D%5Bas_property%5D=No&amp;claim%5Bdeposit%5D%5Binformation_given_date%281i%29%5D=2002&amp;claim%5Bdeposit%5D%5Binformation_given_date%282i%29%5D=01&amp;claim%5Bdeposit%5D%5Binformation_given_date%283i%29%5D=15&amp;claim%5Bdeposit%5D%5Breceived%5D=Yes&amp;claim%5Bdeposit%5D%5Bref_number%5D=xtNHhYqYmL&amp;claim%5Bjavascript%5D%5Badd_reference_number%5D=No&amp;claim%5Bjavascript%5D%5Bany_legal_costs%5D=No&amp;claim%5Bjavascript%5D%5Bclaimant_two_same_address%5D=Yes&amp;claim%5Bjavascript%5D%5Bdefendant_one_living_in_property%5D=Yes&amp;claim%5Bjavascript%5D%5Bdefendent_two_living_in_property%5D=Yes&amp;claim%5Bjavascript%5D%5Bnumber_of_claimants%5D=2&amp;claim%5Bjavascript%5D%5Bnumber_of_defendants%5D=2&amp;claim%5Bjavascript%5D%5Bother_contact_details%5D=Yes&amp;claim%5Bjavascript%5D%5Bseparate_correspondence_address%5D=Yes&amp;claim%5Blegal_cost%5D%5Blegal_costs%5D=&amp;claim%5Blicense%5D%5Bissued_by%5D=&amp;claim%5Blicense%5D%5Bissued_date%281i%29%5D=&amp;claim%5Blicense%5D%5Bissued_date%282i%29%5D=&amp;claim%5Blicense%5D%5Bissued_date%283i%29%5D=&amp;claim%5Blicense%5D%5Bissued_under_act_part%5D=&amp;claim%5Blicense%5D%5Bmultiple_occupation%5D=No&amp;claim%5Bnotice%5D%5Bdate_served%281i%29%5D=2014&amp;claim%5Bnotice%5D%5Bdate_served%282i%29%5D=01&amp;claim%5Bnotice%5D%5Bdate_served%283i%29%5D=13&amp;claim%5Bnotice%5D%5Bexpiry_date%281i%29%5D=2014&amp;claim%5Bnotice%5D%5Bexpiry_date%282i%29%5D=03&amp;claim%5Bnotice%5D%5Bexpiry_date%283i%29%5D=13&amp;claim%5Bnotice%5D%5Bserved_by_name%5D=Robert+Linley&amp;claim%5Bnotice%5D%5Bserved_method%5D=In+person&amp;claim%5Border%5D%5Bcost%5D=No&amp;claim%5Border%5D%5Bpossession%5D=Yes&amp;claim%5Bpossession%5D%5Bhearing%5D=No&amp;claim%5Bproperty%5D%5Bhouse%5D=Yes&amp;claim%5Bproperty%5D%5Bpostcode%5D=LS1+6AG&amp;claim%5Bproperty%5D%5Bstreet%5D=87+Albion+St%0ALeeds+&amp;claim%5Breference_number%5D%5Breference_number%5D=&amp;claim%5Btenancy%5D%5Bagreement_reissued_for_same_landlord_and_tenant%5D=&amp;claim%5Btenancy%5D%5Bagreement_reissued_for_same_property%5D=&amp;claim%5Btenancy%5D%5Bassured_shorthold_tenancy_notice_served_by%5D=&amp;claim%5Btenancy%5D%5Bassured_shorthold_tenancy_notice_served_date%281i%29%5D=&amp;claim%5Btenancy%5D%5Bassured_shorthold_tenancy_notice_served_date%282i%29%5D=&amp;claim%5Btenancy%5D%5Bassured_shorthold_tenancy_notice_served_date%283i%29%5D=&amp;claim%5Btenancy%5D%5Bassured_shorthold_tenancy_type%5D=one&amp;claim%5Btenancy%5D%5Bdemotion_order_court%5D=&amp;claim%5Btenancy%5D%5Bdemotion_order_date%281i%29%5D=&amp;claim%5Btenancy%5D%5Bdemotion_order_date%282i%29%5D=&amp;claim%5Btenancy%5D%5Bdemotion_order_date%283i%29%5D=&amp;claim%5Btenancy%5D%5Blatest_agreement_date%281i%29%5D=&amp;claim%5Btenancy%5D%5Blatest_agreement_date%282i%29%5D=&amp;claim%5Btenancy%5D%5Blatest_agreement_date%283i%29%5D=&amp;claim%5Btenancy%5D%5Boriginal_assured_shorthold_tenancy_agreement_date%281i%29%5D=&amp;claim%5Btenancy%5D%5Boriginal_assured_shorthold_tenancy_agreement_date%282i%29%5D=&amp;claim%5Btenancy%5D%5Boriginal_assured_shorthold_tenancy_agreement_date%283i%29%5D=&amp;claim%5Btenancy%5D%5Bprevious_tenancy_type%5D=&amp;claim%5Btenancy%5D%5Bstart_date%281i%29%5D=2002&amp;claim%5Btenancy%5D%5Bstart_date%282i%29%5D=01&amp;claim%5Btenancy%5D%5Bstart_date%283i%29%5D=01&amp;claim%5Btenancy%5D%5Btenancy_type%5D=Assured&amp;utf8=%E2%9C%93" content_type="application/x-www-form-urlencoded" method="POST">
          <www_authenticate userid="civil" passwd="mojcivil"/>
        </http>
      </request>
    </session>
    
  </sessions>
</tsung>